[
  {
    "title": "PropertyGuru",
    "startDate": "SEP 2023",
    "endDate": "PRESENT",
    "description": "Worked on growing, improving, and maintaining Asia's largest online property portal.",
    "statements": [
      "Designed a masking algorithm for censoring URLs using regular expressions (RegEx).",
      "Implemented a modern Figma page design using styled-components and Next.js.",
      "Participated in an agile methodology and weighed opinions in sprint plannings.",
      "Verified quality of software by writing unit tests in Jest and Cypress.",
      "Reduced cost and improved DevOps efficiency by creating a pre-push git hook using Husky."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "Mumbo Solutions",
    "startDate": "OCT 2022",
    "endDate": "SEP 2023",
    "description": "Worked on an e-commerce app for a wholesaler to manage and sell products online.",
    "statements": [
      "Created a shopping cart system using React, e-GHL Payments Gateway, Node.js, and Supabase (PostgreSQL).",
      "Implemented authentication flow with React-Router and Supabase Auth API.",
      "Allowed admins to upload photos to products using Supabase Storage API (Amazon s3 Storage).",
      "Implemented mail notification system to alert users using Courier Notification API."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "Expedia Group",
    "startDate": "NOV 2020",
    "endDate": "DEC 2021",
    "description": "Worked on growing, improving, and maintaining a flagship flight search engine for millions of customers daily.",
    "statements": [
      "Implemented Flight Checkout Figma designs using React and CSS.",
      "Improved developer efficiency by integrating Github Actions into the CI/CD pipeline."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "DataChat",
    "startDate": "MAY 2018",
    "endDate": "NOV 2020",
    "description": "Worked on an AI Data Analytics chatbot for enterprises to oversee and forecast their data.",
    "statements": [
      "Created a business intelligence dashboard using React, Redux, and Plotly.",
      "Created a chart library in React and Plotly for displaying business data.",
      "Implemented create, read, update, and delete (CRUD) endpoints in Go for managing users.",
      "Wrote end-to-end test suites in Cypress to secure the stability of the front-end application.",
      "Led a team of 5 engineers to introduce a step-by-step tutorial to onboard new users.",
      "Designed roadmap, broke down tasks, and distributed workload to ensure project delivery.",
      "Mentored new hires through onboarding, technical guidance, and providing code reviews."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  }
]
