[
  {
    "title": "PropertyGuru",
    "startDate": "Sep 2023",
    "endDate": "Present",
    "role": "Software Engineer",
    "description": "Worked on growing, improving, and maintaining Asia's largest online property portal.",
    "statements": [
      "Developed core features by translating Figma designs into styled-components and Next.js.",
      "Augmented a gating feature by designing an algorithm that masks website URLs using RegEx.",
      "Operated in a biweekly cycle of sprint plannings and agile methodologies.",
      "Tested components and features by writing unit tests in Jest.",
      "Enforced development security by enforcing a pre-push git hook using Husky."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "Mumbo Solutions",
    "startDate": "Oct 2022",
    "endDate": "Sep 2023",
    "role": "Lead Software Engineer",
    "description": "Worked on an e-commerce app for a wholesaler to manage and sell products online.",
    "statements": [
      "Developed a full-stack shopping cart system in React, e-GHL Payments Gateway, Node.js, and Supabase (PostgreSQL).",
      "Authenticated users using React-Router and Supabase Auth API.",
      "Supported photo uploads using Supabase Storage API (Amazon s3 Storage).",
      "Notified users via Email using Courier Notification API."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "Expedia Group",
    "startDate": "Nov 2020",
    "endDate": "Dec 2021",
    "role": "Software Engineer",
    "description": "Implemented designs for Expedia's flagship product, a travel agency & metasearch engine, that serves millions of flight passengers daily.",
    "statements": [
      "Developed core checkout experience features by translating Figma designs into React.",
      "Accelerated development workflow by integrating Github Actions into the CI/CD pipeline."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "DataChat",
    "startDate": "May 2018",
    "endDate": "Nov 2020",
    "role": "Lead Software Engineer",
    "description": "Worked on an AI Data Analytics chatbot for enterprises to oversee and forecast their data.",
    "statements": [
      "Developed a business intelligence dashboard using React, Redux and Plotly.",
      "Displayed up-to-date data by automating an analytical data pipeline in React and Python.",
      "Established end-to-end tests in Cypress for CI/CD completeness.",
      "Led a team of 5 engineers to introduce a step-by-step tutorial to onboard new users.",
      "Reviewed pull requests and managed individual deadlines to ensure project delivery.",
      "Created a chart library with pie charts, bar charts, and OpenStreet maps in React and Plotly.",
      "Implemented create, read, update, and delete (CRUD) endpoints in Go for managing users.",
      "Developed a UI wizard for managing users in React, Redux, and Material Table."
    ],
    "status": "active",
    "dateModified": "20/01/2024"
  }
]
