[
  {
    "title": "PropertyGuru",
    "startDate": "Sep 2023",
    "endDate": "Present",
    "role": "Software Engineer",
    "description": "Worked on growing, improving, and maintaining Asia's largest online property portal.",
    "statements": [
      "Developed core property listing features by converting Figma designs into styled-components and Next.js.",
      "Designed an algorithm that masks website URLs using RegEx for gating new users.",
      "Participated in a biweekly cycle of sprint plannings and agile methodologies.",
      "Tested components and features by writing unit tests in Jest.",
      "Streamlined developer workflow by enforcing a pre-push git hook using Husky."
    ],
    "location": "Kuala Lumpur, Malaysia",
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "Mumbo Solutions",
    "startDate": "Oct 2022",
    "endDate": "Sep 2023",
    "role": "Lead Software Engineer",
    "description": "Worked on an e-commerce app for a wholesaler to manage and sell products online.",
    "statements": [
      "Developed a full-stack shopping cart system in React, e-GHL Payments Gateway, Node.js, and Supabase (PostgreSQL).",
      "Developed components using Storybook, organizing them into micro-modules, and assembling the app using the component library.",
      "Developed an authentication system using React-Router and Supabase Auth API.",
      "Developed a module for admins to upload product photos using Supabase Storage API (Amazon s3 Storage).",
      "Developed an email notification system using Courier Notification API."
    ],
    "location": "Penang, Malaysia",
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "Expedia Group",
    "startDate": "Nov 2020",
    "endDate": "Dec 2021",
    "role": "Software Engineer",
    "description": "Implemented designs for Expedia's flagship product, a travel agency & metasearch engine, that serves millions of flight passengers daily.",
    "statements": [
      "Developed core flight checkout experience features in React by analyzing Figma designs, breaking them down into components, and assembling them into production-ready modules.",
      "Augmented developer community workflow by adding a Github Action into the CI/CD pipeline to speed up pull request queues."
    ],
    "location": "Chicago, United States",
    "status": "active",
    "dateModified": "20/01/2024"
  },
  {
    "title": "DataChat",
    "startDate": "May 2018",
    "endDate": "Nov 2020",
    "role": "Lead Software Engineer",
    "description": "Worked on an AI Data Analytics chatbot for enterprises to oversee and forecast their data.",
    "statements": [
      "Spearheaded the development of a business intelligence dashboard in React, Redux and Plotly for businesses to gain insights on their commerce.",
      "Curated an analytical data pipeline in React and Python for CEOs and Managers to observe live data.",
      "Assembled an end-to-end test library in Jest and Cypress to provide developers a way to maintain product excellence.",
      "Led an initiative to onboard new users onto the app by designing and developing a step-by-step tutorial, mentoring 5 junior engineers in the process.",
      "Organized feature deliveries by breaking projects into milestones, reviewing pull requests, providing advice, and assuring project delivery timelines.",
      "Assembled a chart library in React, Redux, and Plotly for displaying data as pie charts, bar charts, and geometric maps.",
      "Developed a file manager in React and Go with support for uploading, viewing, and removing files.",
      "Refined a chart library by adding visualization options for CEOs, Managers, and Data Analysts to perform deeper data analysis."
    ],
    "location": "Wisconsin, United States",
    "status": "active",
    "dateModified": "20/01/2024"
  }
]
